blog/2020-02-03-forkjoin中的窃取机制.org
#+TITLE: ForkJoin中的窃取机制
#+DATE: 2020-02-07
#+SETUPFILE: ~/Hexo/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: java
#+JEKYLL_TAGS: java
#+JEKYLL_PUBLISHED: true

从jdk1.7开始，jdk提供了ForkJoin相关工具类。
与其他ExecutorService实现相比，其能够充分地利用多核优势来提高执行性能:
1. 通过采用工作窃取算法，使得未被分配任务的工作线程也能从忙碌线程那窃取任务协助执行。
2. 抽象ForkJoinTask提供了模板方法，以更好地支持将大任务拆分成小任务的分而治冶思想。

本文基于jdk13的代码，来探讨下ForkJoin框架对于任务何时窃取，以及怎么窃取的问题。

* WorkQueue
ForkJoinPool中的WorkQueue被声明为数组形式，其通过区分外部提交和任务执行过程中产生的任务，
优先执行提交任务所产生的子任务，从而优先完成已经开始执行的提交任务。
该数组根据任务的来源区分为:
| 数组下标 | 任务来源                         | 是否有绑定执行线程       | 被窃取方式                                             |
| 奇数     | ForkJoinTask产生的子任务         | 绑定ForkJoinWorkerThread | 1.runWorker中的scan方法，2.awaitJoin方法窃取的队列任务 |
| 偶数     | 外部提交(非ForkJoinWorkerThread) | 否                       | 1.runWorker中的scan方法                                |

#+begin_src java
WorkQueue[] workQueues;              // main registry
#+end_src

从上面的表格可以看出，窃取分为工作线程主循环中的例程性窃取和join阻塞时辅助性窃取。

