source/_posts/2020-02-03-forkjoin中的窃取机制.html
---
title: "ForkJoin中的窃取机制"
date: 2020-02-07
layout: post
categories: 
- java
tags: 
- java
published: true
comments: 
---
<p>
从jdk1.7开始，jdk提供了ForkJoin相关工具类。
与其他ExecutorService实现相比，其能够充分地利用多核优势来提高执行性能:
</p>
<ol class="org-ol">
<li>通过采用工作窃取算法，使得未被分配任务的工作线程也能从忙碌线程那窃取任务协助执行。</li>
<li>抽象ForkJoinTask提供了模板方法，以更好地支持将大任务拆分成小任务的分而治冶思想。</li>
</ol>

<p>
本文基于jdk13的代码，来探讨下ForkJoin框架对于任务何时窃取，以及怎么窃取的问题。
</p>

<div id="outline-container-orge49b0c0" class="outline-2">
<h2 id="orge49b0c0">WorkQueue</h2>
<div class="outline-text-2" id="text-orge49b0c0">
<p>
ForkJoinPool中的WorkQueue被声明为数组形式，其通过区分外部提交和任务执行过程中产生的任务，
优先执行提交任务所产生的子任务，从而优先完成已经开始执行的提交任务。
该数组根据任务的来源区分为:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">数组下标</td>
<td class="org-left">任务来源</td>
<td class="org-left">是否有绑定执行线程</td>
<td class="org-left">被窃取方式</td>
</tr>

<tr>
<td class="org-left">奇数</td>
<td class="org-left">ForkJoinTask产生的子任务</td>
<td class="org-left">绑定ForkJoinWorkerThread</td>
<td class="org-left">1.runWorker中的scan方法，2.awaitJoin方法窃取的队列任务</td>
</tr>

<tr>
<td class="org-left">偶数</td>
<td class="org-left">外部提交(非ForkJoinWorkerThread)</td>
<td class="org-left">否</td>
<td class="org-left">1.runWorker中的scan方法</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">WorkQueue</span><span style="color: #4f97d7;">[]</span> <span style="color: #7590db;">workQueues</span>;              <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">main registry</span>
</pre>
</div>

<p>
从上面的表格可以看出，窃取分为工作线程主循环中的例程性窃取和join阻塞时辅助性窃取。
</p>
</div>
</div>
