blog/2020-02-03-forkjoin中的窃取机制.org
* 主循环中的例程性窃取
例程性的工作窃取是发生在工作线程主循环中调用链:forkJoinWorkerThread.run() -> pool.runWorker(workQueue) -> scan(workQueue, r)中的scan方法。
其保证了优先完成已开始执行的ForkJoin任务，并且外部提交的任务在任务较多时不发生饥饿现象。

通过scan方法可以看出，其根据调用方runWorker方法所传入的随机数r开始，查找非空的窃取队列。
找到后即调用当前forkJoinWorkerThread对应WorkQueue的topLevelExec，开始常规性运行过程。
#+begin_src java
private boolean scan(WorkQueue w, int r) {
    WorkQueue[] ws; int n;
    if ((ws = workQueues) != null && (n = ws.length) > 0 && w != null) {
        for (int m = n - 1, j = r & m;;) {
            WorkQueue q; int b;
            if ((q = ws[j]) != null && q.top != (b = q.base)) {
                int qid = q.id;
                ForkJoinTask<?>[] a; int cap, k; ForkJoinTask<?> t;
                if ((a = q.array) != null && (cap = a.length) > 0) {
                    t = (ForkJoinTask<?>)QA.getAcquire(a, k = (cap - 1) & b);
                    if (q.base == b++ && t != null &&
                        QA.compareAndSet(a, k, t, null)) {
                        q.base = b;
                        w.source = qid;
                        if (a[(cap - 1) & b] != null)
                            signalWork(q);    // help signal if more tasks
                        w.topLevelExec(t, q,  // random fairness bound
                                       (r | (1 << TOP_BOUND_SHIFT)) & SMASK);
                    }
                }
                return true;
            }
            else if (--n > 0)
                j = (j + 1) & m;
            else
                break;
        }
    }
    return false;
}
#+end_src

topLevelExec方法是执行本地队列任务及窃取任务的主要方法，窃取任务从指定窃取队列以FIFO的顺序取出;
而本地队列FIFO还是LIFO，则由构造器方法中的asyncMode决定（默认为false，也就是LIFO）。

#+begin_src java
public ForkJoinPool(int parallelism,
                    ForkJoinWorkerThreadFactory factory,
                    UncaughtExceptionHandler handler,
                    boolean asyncMode)

mode = parallelism | (asyncMode ? FIFO : 0);
#+end_src

考虑到调用该方法时，本地队列中必定是不存在任务的，因此该次调用中直接执行窃取队列首部的ForkJoinTask。
之后每执行n次(>= 2^10)本地队列任务，尝试执行一次窃取队列任务。
当本地及窃取队列均没有待执行任务时，返回到runWork方法，调整窃取的随机数r后，继续调用scan方法寻找合适的窃取队列。

#+begin_src java
final void topLevelExec(ForkJoinTask<?> t, WorkQueue q, int n) {
    int nstolen = 1;
    for (int j = 0;;) {
        if (t != null)
            t.doExec();
        if (j++ <= n)
            t = nextLocalTask();
        else {
            j = 0;
            t = null;
        }
        if (t == null) {
            if (q != null && (t = q.poll()) != null) {
                ++nstolen;
                j = 0;
            }
            else if (j != 0)
                break;
        }
    }
    ForkJoinWorkerThread thread = owner;
    nsteals += nstolen;
    source = 0;
    if (thread != null)
        thread.afterTopLevelExec();
}
#+end_src

