source/_posts/2020-02-03-forkjoin中的窃取机制.html

<div id="outline-container-org89d01c3" class="outline-2">
<h2 id="org89d01c3">主循环中的例程性窃取</h2>
<div class="outline-text-2" id="text-org89d01c3">
<p>
例程性的工作窃取是发生在工作线程主循环中调用链:forkJoinWorkerThread.run() -&gt; pool.runWorker(workQueue) -&gt; scan(workQueue, r)中的scan方法。
其保证了优先完成已开始执行的ForkJoin任务，并且外部提交的任务在任务较多时不发生饥饿现象。
</p>

<p>
通过scan方法可以看出，其根据调用方runWorker方法所传入的随机数r开始，查找非空的窃取队列。
找到后即调用当前forkJoinWorkerThread对应WorkQueue的topLevelExec，开始常规性运行过程。
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #bc6ec5; font-weight: bold;">scan</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">WorkQueue</span> <span style="color: #7590db;">w</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">r</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">WorkQueue</span><span style="color: #bc6ec5;">[]</span> <span style="color: #7590db;">ws</span>; <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>ws = workQueues<span style="color: #2d9574;">)</span> != <span style="color: #a45bad;">null</span> &amp;&amp; <span style="color: #2d9574;">(</span>n = ws.length<span style="color: #2d9574;">)</span> &gt; <span style="color: #a45bad;">0</span> &amp;&amp; w != <span style="color: #a45bad;">null</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">m</span> = n - <span style="color: #a45bad;">1</span>, <span style="color: #7590db;">j</span> = r &amp; m;;<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #ce537a; font-weight: bold;">WorkQueue</span> <span style="color: #7590db;">q</span>; <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>;
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>q = ws<span style="color: #4f97d7;">[</span>j<span style="color: #4f97d7;">]</span><span style="color: #b1951d;">)</span> != <span style="color: #a45bad;">null</span> &amp;&amp; q.top != <span style="color: #b1951d;">(</span>b = q.base<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">qid</span> = q.id;
                <span style="color: #ce537a; font-weight: bold;">ForkJoinTask</span><span style="color: #b1951d;">&lt;</span>?<span style="color: #b1951d;">&gt;[]</span> <span style="color: #7590db;">a</span>; <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">cap</span>, <span style="color: #7590db;">k</span>; <span style="color: #ce537a; font-weight: bold;">ForkJoinTask</span><span style="color: #b1951d;">&lt;</span>?<span style="color: #b1951d;">&gt;</span> <span style="color: #7590db;">t</span>;
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span>a = q.array<span style="color: #4f97d7;">)</span> != <span style="color: #a45bad;">null</span> &amp;&amp; <span style="color: #4f97d7;">(</span>cap = a.length<span style="color: #4f97d7;">)</span> &gt; <span style="color: #a45bad;">0</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
                    t = <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ForkJoinTask</span><span style="color: #bc6ec5;">&lt;</span>?<span style="color: #bc6ec5;">&gt;</span><span style="color: #4f97d7;">)</span>QA.getAcquire<span style="color: #4f97d7;">(</span>a, k = <span style="color: #bc6ec5;">(</span>cap - <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span> &amp; b<span style="color: #4f97d7;">)</span>;
                    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>q.base == b++ &amp;&amp; t != <span style="color: #a45bad;">null</span> &amp;&amp;
                        QA.compareAndSet<span style="color: #bc6ec5;">(</span>a, k, t, <span style="color: #a45bad;">null</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
                        q.base = b;
                        w.source = qid;
                        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>a<span style="color: #2d9574;">[</span><span style="color: #9cb6ad;">(</span>cap - <span style="color: #a45bad;">1</span><span style="color: #9cb6ad;">)</span> &amp; b<span style="color: #2d9574;">]</span> != <span style="color: #a45bad;">null</span><span style="color: #bc6ec5;">)</span>
                            signalWork<span style="color: #bc6ec5;">(</span>q<span style="color: #bc6ec5;">)</span>;    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">help signal if more tasks</span>
                        w.topLevelExec<span style="color: #bc6ec5;">(</span>t, q,  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">random fairness bound</span>
                                       <span style="color: #2d9574;">(</span>r | <span style="color: #9cb6ad;">(</span><span style="color: #a45bad;">1</span> &lt;&lt; TOP_BOUND_SHIFT<span style="color: #9cb6ad;">)</span><span style="color: #2d9574;">)</span> &amp; SMASK<span style="color: #bc6ec5;">)</span>;
                    <span style="color: #4f97d7;">}</span>
                <span style="color: #b1951d;">}</span>
                <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">true</span>;
            <span style="color: #67b11d;">}</span>
            <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>--n &gt; <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span>
                j = <span style="color: #67b11d;">(</span>j + <span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span> &amp; m;
            <span style="color: #4f97d7; font-weight: bold;">else</span>
                <span style="color: #4f97d7; font-weight: bold;">break</span>;
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
topLevelExec方法是执行本地队列任务及窃取任务的主要方法，窃取任务从指定窃取队列以FIFO的顺序取出;
而本地队列FIFO还是LIFO，则由构造器方法中的asyncMode决定（默认为false，也就是LIFO）。
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">ForkJoinPool</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">parallelism</span>,
                    <span style="color: #ce537a; font-weight: bold;">ForkJoinWorkerThreadFactory</span> <span style="color: #7590db;">factory</span>,
                    <span style="color: #ce537a; font-weight: bold;">UncaughtExceptionHandler</span> <span style="color: #7590db;">handler</span>,
                    <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #7590db;">asyncMode</span><span style="color: #4f97d7;">)</span>

mode = parallelism | <span style="color: #4f97d7;">(</span>asyncMode ? FIFO : <span style="color: #a45bad;">0</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

<p>
考虑到调用该方法时，本地队列中必定是不存在任务的，因此该次调用中直接执行窃取队列首部的ForkJoinTask。
之后每执行n次(&gt;= 2^10)本地队列任务，尝试执行一次窃取队列任务。
当本地及窃取队列均没有待执行任务时，返回到runWork方法，调整窃取的随机数r后，继续调用scan方法寻找合适的窃取队列。
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">topLevelExec</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ForkJoinTask</span><span style="color: #bc6ec5;">&lt;</span>?<span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">t</span>, <span style="color: #ce537a; font-weight: bold;">WorkQueue</span> <span style="color: #7590db;">q</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">nstolen</span> = <span style="color: #a45bad;">1</span>;
    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = <span style="color: #a45bad;">0</span>;;<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>t != <span style="color: #a45bad;">null</span><span style="color: #2d9574;">)</span>
            t.doExec<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>j++ &lt;= n<span style="color: #2d9574;">)</span>
            t = nextLocalTask<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2d9574;">{</span>
            j = <span style="color: #a45bad;">0</span>;
            t = <span style="color: #a45bad;">null</span>;
        <span style="color: #2d9574;">}</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>t == <span style="color: #a45bad;">null</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>q != <span style="color: #a45bad;">null</span> &amp;&amp; <span style="color: #b1951d;">(</span>t = q.poll<span style="color: #4f97d7;">()</span><span style="color: #b1951d;">)</span> != <span style="color: #a45bad;">null</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                ++nstolen;
                j = <span style="color: #a45bad;">0</span>;
            <span style="color: #67b11d;">}</span>
            <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>j != <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span>
                <span style="color: #4f97d7; font-weight: bold;">break</span>;
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #ce537a; font-weight: bold;">ForkJoinWorkerThread</span> <span style="color: #7590db;">thread</span> = owner;
    nsteals += nstolen;
    source = <span style="color: #a45bad;">0</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>thread != <span style="color: #a45bad;">null</span><span style="color: #bc6ec5;">)</span>
        thread.afterTopLevelExec<span style="color: #bc6ec5;">()</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
