blog/2020-02-03-forkjoin中的窃取机制.org
* join阻塞时的窃取
forkjoin任务的join操作主要是通过调用doJoin方法来完成的。
在该方法中，可以看到其根据当前线程是否是forkjoin工作线程(ForkJoinWorkerThread)分别采取两种不同的策略。
#+begin_src java
private int doJoin() {
    int s; Thread t; ForkJoinWorkerThread wt; ForkJoinPool.WorkQueue w;
    return (s = status) < 0 ? s :
        ((t = Thread.currentThread()) instanceof ForkJoinWorkerThread) ?
        (w = (wt = (ForkJoinWorkerThread)t).workQueue).
        tryUnpush(this) && (s = doExec()) < 0 ? s :
        wt.pool.awaitJoin(w, this, 0L) :
        externalAwaitDone();
}
#+end_src
** 非ForkJoinWorkerThread的Join
对于非ForkJoinWorkerThread的外部线程来说，其不会窃取执行其他任务。
只会在阻塞等待任务前，调用tryExternalHelp方法，尝试当前线程直接执行提交任务。
是否能直接执行提交任务，取决于是否能够满足下面三个条件。
值得注意的是，外部线程执行过程中产生的子任务将提交到common池(ForkJoinPool.common)中。
1. 任务提交在common池中
2. 任务提交时的线程Probe值和当前的指向同一个提交队列
3. 任务位于队列尾部

#+begin_src java
private int tryExternalHelp() {
    int s;
    return ((s = status) < 0 ? s:
            (this instanceof CountedCompleter) ?
            ForkJoinPool.common.externalHelpComplete(
                (CountedCompleter<?>)this, 0) :
            ForkJoinPool.common.tryExternalUnpush(this) ?
            doExec() : 0);
}

final boolean tryExternalUnpush(ForkJoinTask<?> task) {
    int r = ThreadLocalRandom.getProbe();
    WorkQueue[] ws; WorkQueue w; int n;
    return ((ws = workQueues) != null &&
            (n = ws.length) > 0 &&
            (w = ws[(n - 1) & r & SQMASK]) != null &&
            w.tryLockedUnpush(task));
}
#+end_src

