source/_posts/2020-02-03-forkjoin中的窃取机制.html

<div id="outline-container-orgd5a8d90" class="outline-2">
<h2 id="orgd5a8d90">join阻塞时的窃取</h2>
<div class="outline-text-2" id="text-orgd5a8d90">
<p>
forkjoin任务的join操作主要是通过调用doJoin方法来完成的。
在该方法中，可以看到其根据当前线程是否是forkjoin工作线程(ForkJoinWorkerThread)分别采取两种不同的策略。
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">doJoin</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">s</span>; <span style="color: #ce537a; font-weight: bold;">Thread</span> <span style="color: #7590db;">t</span>; <span style="color: #ce537a; font-weight: bold;">ForkJoinWorkerThread</span> <span style="color: #7590db;">wt</span>; <span style="color: #a45bad;">ForkJoinPool</span>.<span style="color: #ce537a; font-weight: bold;">WorkQueue</span> <span style="color: #7590db;">w</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">(</span>s = status<span style="color: #bc6ec5;">)</span> &lt; <span style="color: #a45bad;">0</span> ? s :
        <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>t = Thread.currentThread<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span> <span style="color: #4f97d7; font-weight: bold;">instanceof</span> ForkJoinWorkerThread<span style="color: #bc6ec5;">)</span> ?
        <span style="color: #bc6ec5;">(</span>w = <span style="color: #2d9574;">(</span>wt = <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">ForkJoinWorkerThread</span><span style="color: #67b11d;">)</span>t<span style="color: #2d9574;">)</span>.workQueue<span style="color: #bc6ec5;">)</span>.
        tryUnpush<span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">this</span><span style="color: #bc6ec5;">)</span> &amp;&amp; <span style="color: #bc6ec5;">(</span>s = doExec<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span> &lt; <span style="color: #a45bad;">0</span> ? s :
        wt.pool.awaitJoin<span style="color: #bc6ec5;">(</span>w, <span style="color: #4f97d7; font-weight: bold;">this</span>, <span style="color: #a45bad;">0L</span><span style="color: #bc6ec5;">)</span> :
        externalAwaitDone<span style="color: #bc6ec5;">()</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
<div id="outline-container-orga3d1f31" class="outline-3">
<h3 id="orga3d1f31">非ForkJoinWorkerThread的Join</h3>
<div class="outline-text-3" id="text-orga3d1f31">
<p>
对于非ForkJoinWorkerThread的外部线程来说，其不会窃取执行其他任务。
只会在阻塞等待任务前，调用tryExternalHelp方法，尝试当前线程直接执行提交任务。
是否能直接执行提交任务，取决于是否能够满足下面三个条件。
值得注意的是，外部线程执行过程中产生的子任务将提交到common池(ForkJoinPool.common)中。
</p>
<ol class="org-ol">
<li>任务提交在common池中</li>
<li>任务提交时的线程Probe值和当前的指向同一个提交队列</li>
<li>任务位于队列尾部</li>
</ol>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">tryExternalHelp</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">s</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>s = status<span style="color: #2d9574;">)</span> &lt; <span style="color: #a45bad;">0</span> ? s:
            <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">this</span> <span style="color: #4f97d7; font-weight: bold;">instanceof</span> CountedCompleter<span style="color: #2d9574;">)</span> ?
            ForkJoinPool.common.externalHelpComplete<span style="color: #2d9574;">(</span>
                <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">CountedCompleter</span><span style="color: #b1951d;">&lt;</span>?<span style="color: #b1951d;">&gt;</span><span style="color: #67b11d;">)</span><span style="color: #4f97d7; font-weight: bold;">this</span>, <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span> :
            ForkJoinPool.common.tryExternalUnpush<span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">this</span><span style="color: #2d9574;">)</span> ?
            doExec<span style="color: #2d9574;">()</span> : <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #bc6ec5; font-weight: bold;">tryExternalUnpush</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ForkJoinTask</span><span style="color: #bc6ec5;">&lt;</span>?<span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">task</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">r</span> = ThreadLocalRandom.getProbe<span style="color: #bc6ec5;">()</span>;
    <span style="color: #ce537a; font-weight: bold;">WorkQueue</span><span style="color: #bc6ec5;">[]</span> <span style="color: #7590db;">ws</span>; <span style="color: #ce537a; font-weight: bold;">WorkQueue</span> <span style="color: #7590db;">w</span>; <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>ws = workQueues<span style="color: #2d9574;">)</span> != <span style="color: #a45bad;">null</span> &amp;&amp;
            <span style="color: #2d9574;">(</span>n = ws.length<span style="color: #2d9574;">)</span> &gt; <span style="color: #a45bad;">0</span> &amp;&amp;
            <span style="color: #2d9574;">(</span>w = ws<span style="color: #67b11d;">[</span><span style="color: #b1951d;">(</span>n - <span style="color: #a45bad;">1</span><span style="color: #b1951d;">)</span> &amp; r &amp; SQMASK<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span> != <span style="color: #a45bad;">null</span> &amp;&amp;
            w.tryLockedUnpush<span style="color: #2d9574;">(</span>task<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
