blog/2020-02-03-forkjoin中的窃取机制.org
** ForkJoinWorkerThread的Join
对于forkjoin工作线程来说，当等待join的任务位于当前线程的工作队列尾部时，尝试直接执行当前任务。
否则调用forkJoinWorkerThread.pool.awaitJoin方法。
#+begin_src java
private int doJoin() {
    int s; Thread t; ForkJoinWorkerThread wt; ForkJoinPool.WorkQueue w;
    return (s = status) < 0 ? s :
        ((t = Thread.currentThread()) instanceof ForkJoinWorkerThread) ?
        (w = (wt = (ForkJoinWorkerThread)t).workQueue).
        tryUnpush(this) && (s = doExec()) < 0 ? s :
        wt.pool.awaitJoin(w, this, 0L) :
        externalAwaitDone();
}
#+end_src

在awaitJoin方法中，其首先通过tryRemoveAndExec方法，在w(本地工作队列)中查找并执行等待join的任务。
如果依旧是未完成状态，其将进行如下的窃取循环:
1. 在子任务工作队列(奇数索引)中窃取队列头部的task执行。
2. 任务完成则退出。
3. 当子任务工作队列均为空队列，且tryCompensate方法返回值非0，则阻塞至deadline，否则重新进行窃取循环。

tryCompensate方法在没有足够的工作线程时，会创建或激活一个空闲线程来补偿join线程阻塞导致的并行度不足。
该方法返回0表示需要重试，其仅在工作队列状态不一致或cas更新状态失败时出现。

#+begin_src java
final int awaitJoin(WorkQueue w, ForkJoinTask<?> task, long deadline) {
    int s = 0;
    int seed = ThreadLocalRandom.nextSecondarySeed();
    if (w != null && task != null &&
        (!(task instanceof CountedCompleter) ||
         (s = w.helpCC((CountedCompleter<?>)task, 0, false)) >= 0)) {
        w.tryRemoveAndExec(task);
        int src = w.source, id = w.id;
        int r = (seed >>> 16) | 1, step = (seed & ~1) | 2;
        s = task.status;
        while (s >= 0) {
            WorkQueue[] ws;
            int n = (ws = workQueues) == null ? 0 : ws.length, m = n - 1;
            while (n > 0) {
                WorkQueue q; int b;
                if ((q = ws[r & m]) != null && q.source == id &&
                    q.top != (b = q.base)) {
                     /* 执行队列头部任务 */
                    break;
                }
                else {
                    r += step;
                    --n;
                }
            }
            if ((s = task.status) < 0)
                break;
            else if (n == 0) { // empty scan
                long ms, ns; int block;
                if ((ns = deadline - System.nanoTime()) <= 0L)
                    break;                         // timeout
                else if ((ms = TimeUnit.NANOSECONDS.toMillis(ns)) <= 0L)
                    ms = 1L;                       // avoid 0 for timed wait
                if ((block = tryCompensate(w)) != 0) {
                    task.internalWait(ms);
                    CTL.getAndAdd(this, (block > 0) ? RC_UNIT : 0L);
                }
                s = task.status;
            }
        }
    }
    return s;
}
#+end_src

