source/_posts/2020-02-03-forkjoin中的窃取机制.html

<div id="outline-container-org96a8307" class="outline-3">
<h3 id="org96a8307">ForkJoinWorkerThread的Join</h3>
<div class="outline-text-3" id="text-org96a8307">
<p>
对于forkjoin工作线程来说，当等待join的任务位于当前线程的工作队列尾部时，尝试直接执行当前任务。
否则调用forkJoinWorkerThread.pool.awaitJoin方法。
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">doJoin</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">s</span>; <span style="color: #ce537a; font-weight: bold;">Thread</span> <span style="color: #7590db;">t</span>; <span style="color: #ce537a; font-weight: bold;">ForkJoinWorkerThread</span> <span style="color: #7590db;">wt</span>; <span style="color: #a45bad;">ForkJoinPool</span>.<span style="color: #ce537a; font-weight: bold;">WorkQueue</span> <span style="color: #7590db;">w</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">(</span>s = status<span style="color: #bc6ec5;">)</span> &lt; <span style="color: #a45bad;">0</span> ? s :
        <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>t = Thread.currentThread<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span> <span style="color: #4f97d7; font-weight: bold;">instanceof</span> ForkJoinWorkerThread<span style="color: #bc6ec5;">)</span> ?
        <span style="color: #bc6ec5;">(</span>w = <span style="color: #2d9574;">(</span>wt = <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">ForkJoinWorkerThread</span><span style="color: #67b11d;">)</span>t<span style="color: #2d9574;">)</span>.workQueue<span style="color: #bc6ec5;">)</span>.
        tryUnpush<span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">this</span><span style="color: #bc6ec5;">)</span> &amp;&amp; <span style="color: #bc6ec5;">(</span>s = doExec<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span> &lt; <span style="color: #a45bad;">0</span> ? s :
        wt.pool.awaitJoin<span style="color: #bc6ec5;">(</span>w, <span style="color: #4f97d7; font-weight: bold;">this</span>, <span style="color: #a45bad;">0L</span><span style="color: #bc6ec5;">)</span> :
        externalAwaitDone<span style="color: #bc6ec5;">()</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
在awaitJoin方法中，其首先通过tryRemoveAndExec方法，在w(本地工作队列)中查找并执行等待join的任务。
如果依旧是未完成状态，其将进行如下的窃取循环:
</p>
<ol class="org-ol">
<li>在子任务工作队列(奇数索引)中窃取队列头部的task执行。</li>
<li>任务完成则退出。</li>
<li>当子任务工作队列均为空队列，且tryCompensate方法返回值非0，则阻塞至deadline，否则重新进行窃取循环。</li>
</ol>

<p>
tryCompensate方法在没有足够的工作线程时，会创建或激活一个空闲线程来补偿join线程阻塞导致的并行度不足。
该方法返回0表示需要重试，其仅在工作队列状态不一致或cas更新状态失败时出现。
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">awaitJoin</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">WorkQueue</span> <span style="color: #7590db;">w</span>, <span style="color: #ce537a; font-weight: bold;">ForkJoinTask</span><span style="color: #bc6ec5;">&lt;</span>?<span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">task</span>, <span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #7590db;">deadline</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">s</span> = <span style="color: #a45bad;">0</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">seed</span> = ThreadLocalRandom.nextSecondarySeed<span style="color: #bc6ec5;">()</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>w != <span style="color: #a45bad;">null</span> &amp;&amp; task != <span style="color: #a45bad;">null</span> &amp;&amp;
        <span style="color: #2d9574;">(</span><span style="color: #a45bad;">!</span><span style="color: #67b11d;">(</span>task <span style="color: #4f97d7; font-weight: bold;">instanceof</span> CountedCompleter<span style="color: #67b11d;">)</span> ||
         <span style="color: #67b11d;">(</span>s = w.helpCC<span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">CountedCompleter</span><span style="color: #bc6ec5;">&lt;</span>?<span style="color: #bc6ec5;">&gt;</span><span style="color: #4f97d7;">)</span>task, <span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">false</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> &gt;= <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        w.tryRemoveAndExec<span style="color: #2d9574;">(</span>task<span style="color: #2d9574;">)</span>;
        <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">src</span> = w.source, <span style="color: #7590db;">id</span> = w.id;
        <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">r</span> = <span style="color: #2d9574;">(</span>seed &gt;&gt;&gt; <span style="color: #a45bad;">16</span><span style="color: #2d9574;">)</span> | <span style="color: #a45bad;">1</span>, <span style="color: #7590db;">step</span> = <span style="color: #2d9574;">(</span>seed &amp; ~<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span> | <span style="color: #a45bad;">2</span>;
        s = task.status;
        <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #2d9574;">(</span>s &gt;= <span style="color: #a45bad;">0</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #ce537a; font-weight: bold;">WorkQueue</span><span style="color: #67b11d;">[]</span> <span style="color: #7590db;">ws</span>;
            <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span> = <span style="color: #67b11d;">(</span>ws = workQueues<span style="color: #67b11d;">)</span> == <span style="color: #a45bad;">null</span> ? <span style="color: #a45bad;">0</span> : ws.length, <span style="color: #7590db;">m</span> = n - <span style="color: #a45bad;">1</span>;
            <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #67b11d;">(</span>n &gt; <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                <span style="color: #ce537a; font-weight: bold;">WorkQueue</span> <span style="color: #7590db;">q</span>; <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span>;
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span>q = ws<span style="color: #bc6ec5;">[</span>r &amp; m<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span> != <span style="color: #a45bad;">null</span> &amp;&amp; q.source == id &amp;&amp;
                    q.top != <span style="color: #4f97d7;">(</span>b = q.base<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
                     <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">&#25191;&#34892;&#38431;&#21015;&#22836;&#37096;&#20219;&#21153; */</span>
                    <span style="color: #4f97d7; font-weight: bold;">break</span>;
                <span style="color: #b1951d;">}</span>
                <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #b1951d;">{</span>
                    r += step;
                    --n;
                <span style="color: #b1951d;">}</span>
            <span style="color: #67b11d;">}</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>s = task.status<span style="color: #b1951d;">)</span> &lt; <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span>
                <span style="color: #4f97d7; font-weight: bold;">break</span>;
            <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>n == <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">empty scan</span>
                <span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #7590db;">ms</span>, <span style="color: #7590db;">ns</span>; <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">block</span>;
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span>ns = deadline - System.nanoTime<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span> &lt;= <span style="color: #a45bad;">0L</span><span style="color: #b1951d;">)</span>
                    <span style="color: #4f97d7; font-weight: bold;">break</span>;                         <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">timeout</span>
                <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span>ms = <span style="color: #a45bad;">TimeUnit</span>.NANOSECONDS.toMillis<span style="color: #bc6ec5;">(</span>ns<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> &lt;= <span style="color: #a45bad;">0L</span><span style="color: #b1951d;">)</span>
                    ms = <span style="color: #a45bad;">1L</span>;                       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">avoid 0 for timed wait</span>
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span>block = tryCompensate<span style="color: #bc6ec5;">(</span>w<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> != <span style="color: #a45bad;">0</span><span style="color: #b1951d;">)</span> <span style="color: #b1951d;">{</span>
                    task.internalWait<span style="color: #4f97d7;">(</span>ms<span style="color: #4f97d7;">)</span>;
                    CTL.getAndAdd<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">this</span>, <span style="color: #bc6ec5;">(</span>block &gt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span> ? RC_UNIT : <span style="color: #a45bad;">0L</span><span style="color: #4f97d7;">)</span>;
                <span style="color: #b1951d;">}</span>
                s = task.status;
            <span style="color: #67b11d;">}</span>
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> s;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
